      *----------------------------------------------------------------*
      *    COPY DEL ARCHIVO MAESTRO DE EMPLEADOS
      *
      *----------------------------------------------------------------*
       01 WS-ENT-MAESTRO.
          05 WS-ENT-LEGAJO                  PIC X(10).
          05 WS-ENT-NOMBRE                  PIC X(25).
          05 WS-ENT-DIRECCION               PIC X(30).
