      *----------------------------------------------------------------*
      *    COPY DEL ARCHIVO DE NOVEDADES
      *
      *----------------------------------------------------------------*
       01 WS-NOV-NOVEDADES.
          05 WS-NOV-LEGAJO                  PIC X(10).
          05 WS-NOV-NOMBRE                  PIC X(25).
          05 WS-NOV-DIRECCION               PIC X(30).
          05 WS-NOV-TIPO                    PIC X(01).
